Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 168, 168, 64)      9472      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 84, 84, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 84, 84, 128)       73856     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 84, 84, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 42, 42, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 42, 42, 256)       295168    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 42, 42, 256)       590080    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 21, 21, 256)       0         
_________________________________________________________________
flatten (Flatten)            (None, 112896)            0         
_________________________________________________________________
dense (Dense)                (None, 128)               14450816  
_________________________________________________________________
batch_normalization (BatchNo (None, 128)               512       
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 320)               41280     
_________________________________________________________________
dropout_1 (Dropout)          (None, 320)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 642       
=================================================================
Total params: 15,609,410
Trainable params: 15,609,154
Non-trainable params: 256
_________________________________________________________________
