Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 126, 126, 64)      4864      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 63, 63, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 63, 63, 128)       73856     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 63, 63, 128)       147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 31, 31, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 31, 31, 256)       295168    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 31, 31, 256)       590080    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 15, 15, 256)       0         
_________________________________________________________________
flatten (Flatten)            (None, 57600)             0         
_________________________________________________________________
dense (Dense)                (None, 416)               23962016  
_________________________________________________________________
batch_normalization (BatchNo (None, 416)               1664      
_________________________________________________________________
dropout (Dropout)            (None, 416)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 416)               173472    
_________________________________________________________________
dropout_1 (Dropout)          (None, 416)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 834       
=================================================================
Total params: 25,249,538
Trainable params: 25,248,706
Non-trainable params: 832
_________________________________________________________________
